{"/about":{"title":"Welcome to FOSS Community University of Kelaniya","data":{"":"Hello, world!this is code"}},"/colors":{"title":"Color Guideline","data":{"introduction#Introduction":"The color system is designed to establish a cohesive visual identity for our FOSS UOK community. It ensures that all components across the website maintain consistency, accessibility, and usability. The palette includes primary, secondary, neutral, and alert colors, with defined variants for flexibility.","color-palette#Color Palette":"","primary-colors#Primary Colors":"These are the primary colors used to establish the visual identity and highlight important elements of the design.\nBackground Dark Blue: #0f172aUsed for the primary background of the website, providing a bold and immersive base.\nText White: #ffffffUsed for the main text and headings to ensure high contrast and readability against the dark background.","secondary-colors#Secondary Colors":"Secondary colors complement the primary palette, adding contrast and emphasis.\nButton Purple: #9333eaUsed for primary action buttons to grab attention.\nHover Purple: #7c25ccA slightly darker shade of purple for hover states on buttons to indicate interactivity.","neutral-colors#Neutral Colors":"Neutral colors are used for accents, inactive elements, and text.\nLight Gray: #bbc2ccUsed for card surfaces or light backgrounds.\nMedium Gray: #6b6d72Used for secondary text, borders, or dividers.\nDark Gray: #293041Used for inactive buttons or subtle text elements.","alert-colors#Alert Colors":"Used for status indicators like success, warnings, or errors.\nSuccess Green: #27ae60Indicates success messages or confirmations.\nWarning Yellow: #f1c40fHighlights warnings or non-critical alerts.\nError Red: #e74c3cDraws attention to critical errors or issues."}},"/components":{"title":"Components","data":{"":"Guide to Using Mantine UI with Primer DesignMantine UI is our chosen component library for building the FOSS_Official_Website. To maintain design consistency, we align all Mantine components with Primer Design, GitHub’s design system. This guide explains how to integrate Mantine UI components while ensuring they adhere to Primer Design principles.","1-understanding-the-design-alignment#1. Understanding the Design Alignment":"Mantine UI provides flexible, customizable React components.\nPrimer Design offers a structured design language that maintains consistency.\nWe use Mantine UI components while applying Primer’s styles, spacing, and accessibility standards.","2-installing-mantine-ui#2. Installing Mantine UI":"If Mantine UI is not already installed, add it to your project:\nnpm install @mantine/core @mantine/hooks\nFor icons:\nnpm install @mantine/icons","3-applying-primer-design-to-mantine-components#3. Applying Primer Design to Mantine Components":"Mantine components are styled using built-in props, but we customize them to match Primer Design. Here’s how:","buttons#Buttons":"Customize Mantine buttons to match Primer’s button styles:\nimport { Button } from '@mantine/core';\n<Button size=\"sm\" radius=\"xl\" styles={{\n  root: { backgroundColor: '#1f6feb', color: 'white', fontWeight: 600 }\n}}>\n  Primer-Styled Button\n</Button>","cards#Cards":"Align Mantine’s Card component with Primer’s design system:\nimport { Card, Text } from '@mantine/core';\n<Card shadow=\"sm\" padding=\"lg\" radius=\"md\" style={{ backgroundColor: '#f6f8fa' }}>\n  <Text weight={600}>Primer-Styled Card</Text>\n</Card>","4-using-primers-utility-classes-in-mantine#4. Using Primer’s Utility Classes in Mantine":"Primer provides utility classes for spacing, flexbox, and colors. These can be applied within Mantine’s sx prop:\n<Box sx={{ display: 'flex', gap: '16px', padding: '16px' }}>\n  <Button>Button 1</Button>\n  <Button>Button 2</Button>\n</Box>","5-ensuring-accessibility-and-responsiveness#5. Ensuring Accessibility and Responsiveness":"Use Mantine’s accessibility hooks to ensure WCAG compliance.\nUse Primer’s responsive spacing and color contrast.\nEnsure all interactive elements have proper aria-labels.","6-theming-mantine-to-match-primer#6. Theming Mantine to Match Primer":"We can override Mantine’s default theme to match Primer Design:\nimport { MantineProvider } from '@mantine/core';\n<MantineProvider theme={{\n  colors: { primary: ['#1f6feb'] },\n  fontFamily: 'Inter, sans-serif'\n}}>\n  <App />\n</MantineProvider>","7-final-checklist-for-ui-consistency#7. Final Checklist for UI Consistency":"✔ Use Mantine components with Primer-aligned styles.\n✔ Lot of templates are available in Mantine UI library, Use them accordingly.\n✔ Follow Primer’s spacing, colors, and typography.\n✔ Apply responsive and accessible design principles.\n✔ Ensure proper component theming.By following these guidelines, we ensure that our website remains visually consistent while leveraging Mantine’s powerful component system. Happy coding! 🚀"}},"/contribute":{"title":"How to Contribute","data":{"":"Welcome to FOSS Community, University of Kelaniya (FOSSUOK)! We maintain several repositories, including the FOSS_Official_Website. This guide will help new contributors get started with contributing to our repositories directly via GitHub.","1-cloning-the-repository#1. Cloning the Repository":"To contribute, first, clone the repository to your local machine.","steps-to-clone#Steps to Clone:":"Open a terminal.\nNavigate to the directory where you want to store the project.\nRun the following command:\ngit clone https://github.com/FOSSUOK/FOSS_Official_Website.git\nNavigate into the project directory:\ncd FOSS_Official_Website\nIf you are outside the organization, you may need to fork the repository before cloning.","2-setting-up-the-project#2. Setting Up the Project":"After cloning the repository, set up the project environment:\nEnsure you have Node.js and npm installed.\nInstall project dependencies:\nnpm install\nStart the development server:\nnpm run dev\nThis will launch the project in your browser at http://localhost:3000/.","3-creating-a-new-branch#3. Creating a New Branch":"Before making changes, create a new branch:\ngit branch your-feature-branch\ngit checkout your-feature-branch\nReplace your-feature-branch with a meaningful name for your changes.","4-making-changes--committing#4. Making Changes & Committing":"Make your modifications in the codebase.\nStage your changes:\ngit add .\nCommit your changes with a meaningful message:\ngit commit -m \"Add feature: brief description\"","5-pushing-changes--creating-a-pull-request#5. Pushing Changes & Creating a Pull Request":"Push your branch to GitHub:\ngit push origin your-feature-branch\nGo to the repository on GitHub.\nClick on Pull Requests > New Pull Request.\nSelect your branch and submit the pull request for review.","6-staying-updated-with-the-main-repository#6. Staying Updated with the Main Repository":"To keep your local repository up to date with the latest changes:\ngit pull origin main\nThis ensures you are working with the latest version of the project.By following these steps, you can successfully contribute to FOSSUOK repositories. Happy coding!"}},"/guidance":{"title":"Guidance for Contributors","data":{"":"Welcome to the contributor's guide for FOSS UoK website! We follow the Primer Design system, which is GitHub’s design system. Primer provides a consistent and accessible user experience across different platforms. If you’re a beginner looking to contribute, this document will help you understand the key principles and guidelines to follow.We also use Mantine UI for our components and ensure they are aligned with Primer Design principles.","guidelines-for-contributors#Guidelines for Contributors":"","1-follow-the-primer-styling#1. Follow the Primer Styling":"Instead of using default Primer components, we used Mantine UI components to develop website.\nEnsure that Mantine UI components are styled and customized to align with Primer Design.\nFollow the typography and spacing conventions defined in Primer.","2-maintain-consistency#2. Maintain Consistency":"Stick to the defined color palette and UI elements.\nEnsure buttons, inputs, and navigation bars match the existing style.\nWhen using Mantine UI components, apply Primer-compatible styles and configurations.","3-accessibility-matters#3. Accessibility Matters":"Always ensure proper contrast, focus states, and keyboard navigability.\nUse ARIA attributes where necessary to improve usability.","4-responsive-design#4. Responsive Design":"Ensure the website looks good on different screen sizes.\nUse flexible grid layouts and avoid fixed widths.","5-code-standards#5. Code Standards":"Keep code clean and well-documented.\nFollow semantic HTML principles and use BEM naming convention for CSS.","6-testing--review#6. Testing & Review":"Before submitting a pull request, test your changes in both light and dark modes.\nEnsure no breaking changes in existing components.\nVerify that Mantine UI components function correctly and maintain the Primer Design look and feel.\nBy following these guidelines, you can contribute effectively while maintaining the integrity of our website’s design. Happy coding!"}},"/":{"title":"Welcome to the FOSS Community - University of Kelaniya 🚀","data":{"":"Hello future FOSS enthusiasts! Whether you're a seasoned wizard or a coding newbie, you've found your way to the right place. Welcome to the beginning of our exciting journey into the world of Free and Open Source Software at the University of Kelaniya.","about-us#About Us":"We're a newly formed community of tech enthusiasts, passionate about diving into the world of open-source magic. As we embark on this adventure together, we invite you to join us in building something extraordinary.","what-we-aim-to-do#What We Aim to Do":"Learn and Grow: Together, let's explore the vast universe of open-source technologies. From coding to documentation, there's always something new to discover.\nConnect and Collaborate: Although our repository shelves might be bare for now, we're eager to fill them with collaborative projects. Let's join forces and create something amazing.\nBuild a Friendly Community: Every great adventure needs companions. We're here to foster a welcoming and supportive community where questions are encouraged, and learning is a shared experience.","how-to-get-involved#How to Get Involved":"We might not have many projects yet, but that's where you come in! Here's how you can get involved:\n🤝 Join the Conversation: Hop into our Discussions and say hello. Let's get to know each other.\n🚀 Start Small: Even if you're new to coding, there's a place for you here. Check out some beginner-friendly issues, or propose a simple project idea.\n🌱 Plant the Seeds: Have an idea for a project? Share it with the community. We're all ears and excited to see what magic you can bring to the table.","future-adventures#Future Adventures":"Stay tuned for upcoming events, workshops, and collaborative coding sessions. As we grow, so will the magic we create together.","connect-with-us#Connect With Us":"Facebook\nTwitter\nLinkedIn\nLet's embark on this journey together and make our mark in the world of open-source magic. The adventure begins now! 🌟✨🚀\n#!/bin/bash\n# Title: FOSS Magic Script\necho \"🎩✨ Welcome to the FOSS Magic Community! 🌟✨\"\nfunction cast_spell() {\n  local spell_name=$1\n  echo \"🧙 Casting spell: $spell_name ✨\"\n}\ncast_spell \"Collaborate\"\ncast_spell \"Innovate\"\ncast_spell \"Celebrate\"\necho \"🎉 Let the magic begin! Explore, learn, and create wonders together! 🚀🌈\""}},"/typography":{"title":"Typography","data":{"":"This guide defines the fonts, sizes, weights, and usage patterns to ensure consistent readability and design throughout the interface.","font-family#Font Family":"Primary Font: Inter\nServes as the default font for headings, body text, buttons, and most UI elements.\nFallback Fonts: Arial, sans-serif\nProvide a fallback for environments where the primary font is unavailable.\nMonospace Font: JetBrains Mono\nFor code snippets.\nCSS Declaration\n:root {\n    --font-primary: \"Inter\", Arial, sans-serif;\n    --font-monospace: \"JetBrainsMono\";\n}","usage-example#Usage Example":"body {\n    font-family: var(--font-primary);\n}","font-size#Font Size":"A modular scale is used for font sizes to establish a clear visual hierarchy and improve readability.Scale\nRole\tFont Size\tLine Height\tUsage\tDisplay Heading (H1)\t48px\t1.2\tMajor page headers, hero sections.\tSection Heading (H2)\t36px\t1.3\tSection titles.\tSubheading (H3)\t24px\t1.4\tSubsection headers.\tBody Text\t16px\t1.6\tMain content and paragraphs.\tSmall Text\t14px\t1.6\tCaptions and secondary information.\tTiny Text\t12px\t1.5\tFootnotes and disclaimers.\t\nCSS Variables\n:root {\n    --font-size-display: 3rem; /* 48px */\n    --font-size-heading: 2.25rem; /* 36px */\n    --font-size-subheading: 1.5rem; /* 24px */\n    --font-size-body: 1rem; /* 16px */\n    --font-size-small: 0.875rem; /* 14px */\n    --font-size-tiny: 0.75rem; /* 12px */\n}","usage-example-1#Usage Example":"h1 {\n    font-size: var(--font-size-display);\n    line-height: 1.2;\n}\np {\n    font-size: var(--font-size-body);\n    line-height: 1.6;\n}","font-weights#Font Weights":"Weights\nName\tValue\tUsage\tRegular\t400\tBody text and general content.\tMedium\t500\tSubheadings or semi-emphasis.\tBold\t700\tHeadings and highlighted content.\t\nCSS Variables\n:root {\n    --font-weight-regular: 400;\n    --font-weight-medium: 500;\n    --font-weight-bold: 700;\n}","usage-example-2#Usage Example":"h1 {\n    font-weight: var(--font-weight-bold);\n}\np {\n    font-weight: var(--font-weight-regular);\n}","text-alignment#Text Alignment":"Alignment Options\nAlignment\tCSS Property\tUsage\tLeft-Aligned\ttext-align: left;\tDefault for paragraphs and headers.\tCenter-Aligned\ttext-align: center;\tTitles, banners, and hero sections.\tRight-Aligned\ttext-align: right;\tRare cases, e.g., metadata or special UI elements.\t\nCSS Classes\n.text-left {\n    text-align: left;\n}\n.text-center {\n    text-align: center;\n}\n.text-right {\n    text-align: right;\n}","accessibility#Accessibility":"Use appropriate heading levels (<h1> to <h6>).\nMaintain a minimum 4.5:1 contrast ratio."}}}